In [1]:
import pandas as pd

In [2]:
foods = pd.read_csv("restaurant_foods.csv", index_col = "Food ID")
costumers = pd.read_csv("restaurant_customers.csv", index_col = "ID")

week1 = pd.read_csv("restaurant_week_1_sales.csv")
week2 = pd.read_csv("restaurant_week_2_sales.csv")

In [3]:
pd.concat([week1, week2], ignore_index = True).sort_index()
pd.concat([week1, week2], keys = ["Week 1", "Week 2"])

            Customer ID  Food ID
Week 1 0            537        9
       1             97        4
       2            658        1
       3            202        2
       4            155        9
...                 ...      ...
Week 2 245          783       10
       246          556       10
       247          547        9
       248          252        9
       249          249        6

[500 rows x 2 columns]

In [4]:
df1 = pd.DataFrame([1, 2, 3], columns = ["A"])
df2 = pd.DataFrame([4, 5, 6], columns = ["B"])

In [5]:
pd.concat([df1, df2], axis = "columns")

   A  B
0  1  4
1  2  5
2  3  6

In [6]:
week1.merge(foods, how = "left", on = "Food ID")

     Customer ID  Food ID   Food Item  Price
0            537        9       Donut   0.99
1             97        4  Quesadilla   4.25
2            658        1       Sushi   3.99
3            202        2     Burrito   9.99
4            155        9       Donut   0.99
..           ...      ...         ...    ...
245          413        9       Donut   0.99
246          926        6       Pasta  13.99
247          134        3        Taco   2.99
248          396        6       Pasta  13.99
249          535       10       Drink   1.75

[250 rows x 4 columns]

In [7]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [8]:
costumers.head()

   First Name Last Name  Gender  Company                     Occupation
ID
1      Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
2    Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
3       Roger     Black    Male  Tagfeed              Account Executive
4      Steven     Evans    Male     Fatz               Registered Nurse
5        Judy  Morrison  Female  Demivee                Legal Assistant

In [9]:
# week2.merge(costumers, how = "left", left_on = "Customer ID", right_on = "ID")
# week2.merge(costumers, how = "left", left_on = "Customer ID", right_on = "ID").drop("ID", axis = 1)

In [10]:
week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [11]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [12]:
week1.merge(week2, how = "inner", on = "Customer ID", suffixes = ([" - Week 1", " - Week 2"]))

    Customer ID  Food ID - Week 1  Food ID - Week 2
0           537                 9                 5
1           155                 9                 3
2           503                 5                 8
3           503                 5                 9
4           155                 1                 3
..          ...               ...               ...
57          945                 5                 4
58          343                 3                 5
59          343                 3                 2
60          343                 3                 7
61          621                 9                 6

[62 rows x 3 columns]

In [13]:
week1.merge(week2, how = "inner", on = ["Customer ID", "Food ID"])

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5          922        1
6           21        4
7          578        5
8          578        5

In [14]:
condition_one = week1["Customer ID"] == 21
condition_two = week1["Food ID"] == 4
week1[condition_one & condition_two]

     Customer ID  Food ID
101           21        4
212           21        4

In [15]:
condition_one = week2["Customer ID"] == 21
condition_two = week2["Food ID"] == 4
week2[condition_one & condition_two]

    Customer ID  Food ID
30           21        4

In [16]:
week1.merge(week2, how = "outer", on = "Customer ID", suffixes = [" - Week 1", " - Week 2"])

     Customer ID  Food ID - Week 1  Food ID - Week 2
0              3               2.0               NaN
1              8               NaN               6.0
2             10               2.0               NaN
3             13               NaN               2.0
4             20               1.0               NaN
..           ...               ...               ...
449          985               5.0               NaN
450          991               2.0               NaN
451          994               NaN               2.0
452          996               NaN              10.0
453         1000               2.0               NaN

[454 rows x 3 columns]

In [17]:
week1.merge(
    costumers, how = "left", left_on = "Customer ID", right_index = True
).merge()

TypeError: DataFrame.merge() missing 1 required positional argument: 'right'